metadata:
  version: 1
  description: Splunk Queries
  data_environments: [Splunk]
  data_families: [SplunkGeneral]
  tags: ['alert', 'securityalert', 'process', 'account', 'network']
defaults:
  metadata:
    data_source: 'bots'
  parameters:
    index:
      description: 'Splunk index name'
      type: str
      default: '*'
    source:
      description: 'Splunk source type'
      type: str
      default: '*'
    start:
      description: Query start time
      type: datetime
    end:
      description: Query end time
      type: datetime
    project_fields:
      description: Project Field names
      type: str
      default: '| table TimeCreated, host, EventID, EventDescription, User, process, cmdline, Image, parent_process, ParentCommandLine, dest, Hashes'
    add_query_items:
      description: Additional query clauses
      type: str
      default: '| head 100'
    timeformat:
      description: 'Datetime format to use in Splunk query'
      type: str
      default: '"%Y-%m-%d %H:%M:%S.%6N"'
sources:
  list_all_datatypes:
    description: Summary of all events by index and sourcetype
    metadata:
      data_families: [SplunkGeneral]
    args:
      query: '
      | tstats count as totalCount earliest(_time) as firstTime latest(_time)
        as lastTime where index= "*" timeformat={timeformat} earliest={start} latest={end} by index sourcetype
      | fieldformat firstTime=strftime(firstTime,"%Y/%m/%d %H:%M:%S")
      | fieldformat lastTime=strftime(lastTime,"%Y/%m/%d %H:%M:%S")
      | sort by totalCount desc
      '
    parameters:
  list_all_alerts:
    description: Retrieves all configured alerts
    metadata:
      data_families: [Alerts]
    args:
      query: '
      | rest/servicesNS/-/search/saved/searches
      | search alert.track=1
      | fields title description search disabled triggered_alert_count actions action.script.filename alert.severity cron_schedule'
    parameters:
  list_all_savedsearches:
    description: Retrieves all saved searches
    metadata:
      data_families: [SplunkGeneral]
    args:
      query: '
      | rest /servicesNS/-/-/saved/searches splunk_server=local
      | fields title, description, eai:acl.app, alert.severity, alert.track, alert_type, author, auto_summarize.cron_schedule, cron_schedule, id, is_scheduled, is_visible, qualifiedSearch, realtime_schedule, updated
      '
    parameters:
  list_all_audittrail:
    description: Retrieves all audit trail logs
    metadata:
      data_families: [audittrail]
    args:
      query: '
      search index={index} source=audittrail timeformat={timeformat} earliest={start} latest={end}
      | table timestamp, user, roles, action, info, search_type,  is_realtime, savedsearch_name, search, total_run_time, event_count, result_count
      '
    parameters:
  get_events_parameterized:
    description: Generic parameterized query from index/source
    metadata:
      data_families: [SplunkGeneral]
    args:
      query: '
      search index={index} source={source} timeformat={timeformat} earliest={start} latest={end}
      {project_fields}
      {add_query_items}'
    parameters: