metadata:
  version: 1
  description: MDATP Queries
  data_environments: [MDATP, MDE, M365D, LogAnalytics]
  data_families: [MDATP, MDE]
  tags: ["user"]
defaults:
  metadata:
    data_source: "user_events"
  parameters:
    start:
      description: Query start time
      type: datetime
    end:
      description: Query end time
      type: datetime
    add_query_items:
      description: Additional query clauses
      type: str
      default: ""
    time_column:
      description: The name of the column detailing the time the event was generated.
      type: str
      default: "Timestamp"
sources:
  user_logons:
    description: Lists all user logons by user
    metadata:
    args:
      query: '
        DeviceLogonEvents
        | where {time_column} >= datetime({start})
        | where {time_column} <= datetime({end})
        | where AccountName has "{account_name}"
        {add_query_items}'
      uri: None
    parameters:
      account_name:
        description: Name of user
        type: str
  user_processes:
    description: Lists all processes created by a user
    metadata:
    args:
      query: '
        DeviceProcessEvents
        | where {time_column} >= datetime({start})
        | where {time_column} <= datetime({end})
        | where AccountName has "{account_name}"
        {add_query_items}'
    parameters:
      account_name:
        description: Name of user
        type: str
  user_files:
    description: Lists all files created by a user
    metadata:
    args:
      query: '
        DeviceFileEvents
        | where {time_column} >= datetime({start})
        | where {time_column} <= datetime({end})
        | where InitiatingProcessAccountName contains "{account_name}"
        {add_query_items}'
    parameters:
      account_name:
        description: Name of user
        type: str
  user_network:
    description: Lists all network connections associated with a user
    metadata:
    args:
      query: '
        DeviceNetworkEvents
        | where {time_column} >= datetime({start})
        | where {time_column} <= datetime({end})
        | where InitiatingProcessAccountName contains "{account_name}"
        {add_query_items}'
    parameters:
      account_name:
        description: Name of user
        type: str
